Revit 2027 API
ComponentRepeaterSlot.MakeDefault Method
 Populates the slot with an instance of the default family type of the component repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeDefault()
Public Sub MakeDefault
public:
void MakeDefault()
member MakeDefault : unit -> unit
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace